Documents/АК_РазнесениеБояТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>АК_РазнесениеБояТоваров</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТорговыеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговаяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Перевозчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаБоя</Name>
							<Type>
								<v8:Type>cfg:EnumRef.АК_ПричиныБоя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фотография</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийКФото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаСсылка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоМелкий</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УинОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Внимание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВиртуальныйСклад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/АК_ПричиныБоя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>АК_ПричиныБоя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВыяснено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Брак</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АК_РазнесениеБояТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	//АК БЕЛН 11.01.2017+
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		Сообщить("Необходимо заполнить склад");
		Возврат;
	КонецЕсли; 
	//АК БЕЛН 11.01.2017-
	Если ЭтаФорма.Объект.ТорговыеТочки.Количество() тогда
		Ответ=Вопрос("При заполнении табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет,0,КодВозвратаДиалога.Да,"Подтверждение");
		Если Ответ=КодВозвратаДиалога.Да тогда
		ЗаполнитьНаСервере();
		КонецЕсли;
	Иначе
		ЗаполнитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Документы.АК_РазнесениеБояТоваров.ЗаполнитьНаСервере(Объект);
	ПересчитатьИтоги();
КонецПроцедуры


&НаКлиенте
Процедура ТорговыеТочкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя="ТорговыеТочкиФотография" тогда
		КоличествоКартинокПоСтроке=СтрЧислоВхождений(Элемент.ТекущиеДанные.АдресКартинки,"№№№№");
		МассивКартинок=Новый Массив;
		ОсталосьОбработать=СокрЛП(Элемент.ТекущиеДанные.АдресКартинки);
		Пока ОсталосьОбработать<>"" и КоличествоКартинокПоСтроке>0 цикл
			ОсталосьОбработать=Сред(ОсталосьОбработать,5);//отрезаем первые символы
			НачалоСледующейКартинки=Найти(ОсталосьОбработать,"№№№№");
			Если НачалоСледующейКартинки>0 тогда
				ТекущаяКартинка=Лев(ОсталосьОбработать,НачалоСледующейКартинки-1);
				ОсталосьОбработать=Сред(ОсталосьОбработать,НачалоСледующейКартинки);
			Иначе
				ТекущаяКартинка=ОсталосьОбработать;
				ОсталосьОбработать="";
			КонецЕсли;
			//Картинка = Новый Картинка(ТекущаяКартинка);
			//ОткрытьЗначение(Картинка);
			ТемпФайл = Новый Файл(ТекущаяКартинка);
			ЗапуститьПриложение(ТекущаяКартинка, ТемпФайл.Путь);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТорговыеТочкиПричинаБояПриИзменении(Элемент)
	ПересчитатьИтоги();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьИтоги()
	ЭтаФорма.Итоги.Очистить();
	
	СтрокаИтогов=ЭтаФорма.Итоги.Добавить();
	СтрокаИтогов.Показатель="Сумма";
	СтрокаИтогов.Всего=Объект.ТорговыеТочки.Итог("Сумма");
	ПолучитьИтог(Перечисления.АК_ПричиныБоя.ПустаяСсылка(),СтрокаИтогов.НеОбработано,Ложь);
	ПолучитьИтог(Перечисления.АК_ПричиныБоя.Брак,СтрокаИтогов.Брак,Ложь);
	ПолучитьИтог(Перечисления.АК_ПричиныБоя.НеВыяснено,СтрокаИтогов.НеВыяснено,Ложь);
	ПолучитьИтог(Перечисления.АК_ПричиныБоя.Транспорт,СтрокаИтогов.Транспорт,Ложь);
	ПолучитьИтог(Перечисления.АК_ПричиныБоя.Склад,СтрокаИтогов.Склад,Ложь);
	
	СтрокаИтогов=ЭтаФорма.Итоги.Добавить();
	СтрокаИтогов.Показатель="Количество";
	СтрокаИтогов.Всего=Объект.ТорговыеТочки.Итог("Колво");
	ПолучитьИтог(Перечисления.АК_ПричиныБоя.ПустаяСсылка(),СтрокаИтогов.НеОбработано,Истина);
	ПолучитьИтог(Перечисления.АК_ПричиныБоя.Брак,СтрокаИтогов.Брак,Истина);
	ПолучитьИтог(Перечисления.АК_ПричиныБоя.НеВыяснено,СтрокаИтогов.НеВыяснено,Истина);
	ПолучитьИтог(Перечисления.АК_ПричиныБоя.Транспорт,СтрокаИтогов.Транспорт,Истина);
	ПолучитьИтог(Перечисления.АК_ПричиныБоя.Склад,СтрокаИтогов.Склад,Истина);
	//Отбор=Новый Структура%
	//Отбор.Вставить("ПричинаБоя",Перечисления.АК_ПричиныБоя.ПустаяСсылка());
	//ТаблицаОтбора=Объект.ТорговыеТочки.Выгрузить(Отбор);
	//ЭтаФорма.ИтогНеопределен="Кол "+Строка(ТаблицаОтбора.Итог("Колво"))+" / Сум "+ Строка(ТаблицаОтбора.Итог("Сумма"));
	//

КонецПроцедуры

&НаСервере
Процедура ПолучитьИтог(ПричинаБоя,Реквизит,Кол)
	Отбор=Новый Структура;
	Отбор.Вставить("ПричинаБоя",ПричинаБоя);
	ТаблицаОтбора=Объект.ТорговыеТочки.Выгрузить(Отбор);
	Реквизит=?(Кол,ТаблицаОтбора.Итог("Колво"),ТаблицаОтбора.Итог("Сумма"));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//+++АК sils 07.06.2018 ИП-00018876
	ОперацияАпдекс = APDEX_ОценкаПроизводительностиКлиентСервер.ПолучитьОперацию("Открытие документа Разнесение боя товаров");
	APDEX_ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(ОперацияАпдекс);
	//---АК
	ПересчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьМелкиеСписания()
	Если Не ЭтаФорма.ПоказатьМелкиеСписания тогда
		ЭтаФорма.Элементы.ТорговыеТочки.ОтборСтрок=Новый ФиксированнаяСтруктура("ЭтоМелкий",Ложь);
	Иначе
		ЭтаФОрма.Элементы.ТорговыеТочки.ОтборСтрок=Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтобразитьМелкиеСписания();
	//+++АК sils 07.06.2018 ИП-00018876
	APDEX_ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремени(ОперацияАпдекс, ?(Параметры.Ключ.Пустая(), "Новый документ", "" + Объект.Ссылка));
	//---АК
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьМелкиеСписанияПриИзменении(Элемент)
	ОтобразитьМелкиеСписания();
КонецПроцедуры
